<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"ceeadba2af6c3aeab44b98b940fe7e10097a0dc0bdb25d64058a41c73ae389db","plan_job_ref":"Job Test terraform-refresh #80 at https://github.com/dflook/terraform-github-actions/actions/runs/21525285342","plan_out_hash":"392c1aa2ee745aa5473081507ab44d1cb4c455ccd2b416b99465b504ef420ce6","plan_hash":"393afc5825e7367fe27c69f5e85a5e5badf5f2936d56e48beab510a99d47d038","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Test terraform-refresh #80](https://github.com/dflook/terraform-github-actions/actions/runs/21525285342)